In [4]:
pip install pandas

Requirement already satisfied: pandas in c:\users\mdaza\appdata\local\programs\python\python310\lib\site-packages (2.2.0)
Requirement already satisfied: numpy<2,>=1.22.4 in c:\users\mdaza\appdata\local\programs\python\python310\lib\site-packages (from pandas) (1.26.3)
Requirement already satisfied: pytz>=2020.1 in c:\users\mdaza\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\mdaza\appdata\roaming\python\python310\site-packages (from pandas) (2.8.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\mdaza\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2023.4)
Requirement already satisfied: six>=1.5 in c:\users\mdaza\appdata\roaming\python\python310\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip available: 22.2.2 -> 24.0
[notice] To update, run: python.exe -m pip install --upgrade pip

In [5]:
import pandas as pd

C:\Users\mdaza\AppData\Local\Temp\ipykernel_30364\217833862.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [6]:
pd.__version__

'2.2.0'

In [7]:
data = {
    'Name': [ 'Azaz' , 'Lux' , 'Harshit' , 'Karan' ] , 
    'Age' : [ 20 , 21 , 19 , 18 ] ,
    'City' : [ 'Delhi' , 'Mumbai' , 'Delhi' , 'Mumbai' ] ,
}

In [8]:

df = pd.DataFrame(data)

df

      Name  Age    City
0     Azaz   20   Delhi
1      Lux   21  Mumbai
2  Harshit   19   Delhi
3    Karan   18  Mumbai

In [9]:
df.describe()

             Age
count   4.000000
mean   19.500000
std     1.290994
min    18.000000
25%    18.750000
50%    19.500000
75%    20.250000
max    21.000000

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [11]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [12]:
df.shape

(4, 3)

In [13]:
df.index = [1,3,5,7]

In [25]:
df

      Name  Age    City
1     Azaz   20   Delhi
3      Lux   21  Mumbai
5  Harshit   19   Delhi
7    Karan   18  Mumbai

In [28]:
df.index=range(1,8,2)
df

      Name  Age    City
1     Azaz   20   Delhi
3      Lux   21  Mumbai
5  Harshit   19   Delhi
7    Karan   18  Mumbai

In [30]:
df.index

RangeIndex(start=1, stop=8, step=2)

In [36]:
df.reset_index(inplace=True)
df

   level_0  index     Name  Age    City
0        0      1     Azaz   20   Delhi
1        1      3      Lux   21  Mumbai
2        2      5  Harshit   19   Delhi
3        3      7    Karan   18  Mumbai

In [44]:
df.drop('level_0',axis=1 , inplace=True)

In [46]:
df.drop('index',axis=1 , inplace=True)

In [47]:
df

      Name  Age    City
0     Azaz   20   Delhi
1      Lux   21  Mumbai
2  Harshit   19   Delhi
3    Karan   18  Mumbai

In [38]:
df

   level_0  index     Name  Age    City
0        0      1     Azaz   20   Delhi
1        1      3      Lux   21  Mumbai
2        2      5  Harshit   19   Delhi
3        3      7    Karan   18  Mumbai

In [14]:
type(df)

pandas.core.frame.DataFrame

In [15]:
df.Name

1       Azaz
3        Lux
5    Harshit
7      Karan
Name: Name, dtype: object

In [16]:
type(df.Name)

pandas.core.series.Series

In [17]:
s1 = df['Name']
type(s1)

pandas.core.series.Series

In [18]:
df.Age

1    20
3    21
5    19
7    18
Name: Age, dtype: int64

In [19]:
r1 = df['Age']
r1

1    20
3    21
5    19
7    18
Name: Age, dtype: int64

In [20]:
r1.min()

18

In [21]:
r1.max()

21

In [22]:
r1.mean()

19.5

In [23]:
lists = [1,2,3,4,5,6]
type(lists)

list

In [24]:
s1 = pd.Series(lists)
s1

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64